import type { FC } from 'react';

interface KnowledgeProps { }

const Knowledge: FC<KnowledgeProps> = () => {
    return (
        <>
            <div className='w-full h-full'>
                <div className='grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-3 w-full p-2'>
                    <div className='w-full  border rounded-md'>
                        <p className='p-2 text-sm'>
                            <h1 className='text-lg'>1.मौलिक विश्वास:</h1>
                            मुस्लिम एक परमेश्वर, अल्लाह, में विश्वास करते हैं, जो करुणामय और दयालु हैं।
                            पैगंबर: मुस्लिम पैगंबरों में शामिल हैं, जिसमें आदम, इब्राहीम, मूसा, और ईसा शामिल हैं, जिनमें मुहम्मद अंतिम पैगंबर हैं।
                            पवित्र किताब: क़ुरान इस्लाम की पवित्र किताब है, जिसे ख़ुदा की वाणी के रूप में मानते हैं, जो कि पैगंबर मुहम्मद को प्रकट किया गया था।
                            पाँच स्तंभ: इस्लाम की मूल विश्वासों और प्रथाओं में शामिल हैं: शहादा (ईमान), सलाह (नमाज), ज़कात (चंदा), सौम (रमज़ान में उपवास), और हज्ज (मक्का की पर्यटन यात्रा)।</p>

                    </div>
                    <div className='w-full   border rounded-md'>


                        <p className='p-2 text-sm'>
                            <h1 className='text-lg'> 2. इबादत:</h1>
                            मस्जिद: मुस्लिम सामूहिक इबादत के लिए मस्जिद में इकट्ठा होते हैं।
                            नमाज: मुस्लिम पूरे दिन में पाँच बार नमाज पढ़ते हैं, मक्का की ओर मुँह करके।
                            उपवास: रमज़ान महीने में, मुस्लिम उधारी से सूरजास्त तक उपवास करते हैं।
                            चंदा: मुस्लिमों को चंदा देना अनिवार्य है, जिसे ज़कात कहा जाता है।</p>

                    </div>
                    <div className='w-full  border rounded-md'>
                        <p className='p-2 text-sm'>
                            <h1 className='text-lg'>3. इस्लामिक कानून (शरीया):</h1>
                            शरीया क़ुरान और हदीस (मुहम्मद की शिक्षाओं और प्रथाओं) से निकाली गई है और जीवन के विभिन्न पहलुओं, समृद्धि, नैतिकता, और कानून के मार्गदर्शन प्रदान करती है।
                        </p>

                    </div>
                    <div className='w-full  border rounded-md'>
                        <p className='p-2 text-sm'>
                            <h1 className='text-lg'> 4. इस्लामी संप्रदाय:</h1>
                            सुन्नी: सबसे बड़ा संप्रदाय, जो अधिकांश मुस्लिमों का हिस्सा है।
                            शिया: दूसरा सबसे बड़ा संप्रदाय, जिसमें ईरान, इराक, और कुछ हिस्सों में लेबनान में मुख्य जनसंख्या है।
                        </p>

                    </div>
                    <div className='w-full border rounded-md'>
                        <p className='p-2 text-sm'>
                            <h1 className='text-lg'> 5. इतिहास:</h1>
                            इस्लाम का नेतृत्व 7वीं सदी में अरबी खड़ी में पैगंबर मुहम्मद द्वारा किया गया था।
                            इस्लाम के प्रसार ने विशाल साम्राज्यों की सृजनाएँ की, जैसे कि उमय्यद और अब्बासी सल्तनतें।
                        </p>


                    </div>
                    <div className='w-full border rounded-md'>
                        <p className='p-2 text-sm'>
                         <h1 className='text-lg'>   6. इस्लामी कला और वास्तुकला:</h1>

                            इस्लामी कला जटिल रूपरेखांकन और अरबी कैलिग्राफी के लिए जानी जाती है।
                            इसमें स्पेन की अल्हाम्ब्रा और भारत की ताजमहल जैसे प्रमुख उदाहरण शामिल हैं।</p>

                    </div>

                </div>
            </div>
        </>
    );
}

export default Knowledge;
